Обработки/Reports/_ОтчетПоОперациямНКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетПоОперациямНКО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогСрабатывания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетПоОперациямНКО/Ext/ObjectModule.bsl
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Отчет по операциям НКО", 
		"0.09", 
		"", 
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОтчетПоОперациямНКОЗаПредыдущийДень", "Отчет по операциям НКО за предыдущий день",,  Ложь, "ВызовСерверногоМетода");
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область Интерфейс_для_запуска_загрузки_по_регламентному_заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
		
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,ПорогСрабатывания,ПолучателиОповещения", Новый Структура("ИдентификаторКоманды", ИдентификаторКоманды));
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ВыполнитьКоманду()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Если ИдентификаторКоманды = "ОтчетПоОперациямНКОЗаПредыдущийДень" Тогда
				
		ЭтотОбъект.Период 				= Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
		ЭтотОбъект.ПорогСрабатывания	= ПараметрыКоманды.ПорогСрабатывания;
		ЭтотОбъект.Организация			= ПараметрыКоманды.Организация;
		ПолучателиОповещения			= ПараметрыКоманды.ПолучателиОповещения;

		ОтправитьОтчет(ПолучателиОповещения);
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ОтправитьОтчет(ПолучателиОповещения) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	ЗаполнитьОсновнуюЧастьОтчета(Результат);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Результат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	ТемаПисьма = "Отчет по операциям НКО за " + ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания) + " " + Строка(ЭтотОбъект.Организация.Наименование);
	
	Вложения = Новый Соответствие;
	Вложения.Вставить(ТемаПисьма + ".xlsx", ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла)));
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому"		, ПолучателиОповещения);
	ПараметрыПисьма.Вставить("Тема"		, ТемаПисьма);
	ПараметрыПисьма.Вставить("Тело"		, "Во вложении " + ТемаПисьма);
	ПараметрыПисьма.Вставить("ТипТекста", "ПростойТекст");
	ПараметрыПисьма.Вставить("Вложения"	, Вложения);
	
	РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма,, Истина);			
	
КонецПроцедуры	

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Сессия = Неопределено;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,ПорогСрабатывания");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Попытка
		Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
	КонецПопытки;
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	Если ЭтотОбъект.ВариантОтчета = 0 Тогда
		ЗаполнитьОсновнуюЧастьОтчета(ДокументРезультат);
	Иначе
		ЗаполнитьКлиентов_НКО(ДокументРезультат);
	КонецЕсли;
	
	Если Сессия <> Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОсновнуюЧастьОтчета(ДокументРезультат)

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация"			, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала"			, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"		, ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СписокОПФ_НКО"		, ПолучитьСписокОПФ_НКО());
	Запрос.УстановитьПараметр("ВидыОперацийПайщика"	, ПолучитьВидыОперацийПайщика());
	Запрос.УстановитьПараметр("ПорогСрабатывания"	, ЭтотОбъект.ПорогСрабатывания);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.Период КАК Период,
		|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор,
		|	ОстаткиДенежныхСредств.Организация КАК Организация,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредств.Брокер КАК Брокер,
		|	ОстаткиДенежныхСредств.РасчетныйСчет КАК РасчетныйСчет,
		|	ОстаткиДенежныхСредств.ВидДвижения КАК ВидДвижения,
		|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (&ВидыОперацийПайщика) КАК ОперацияПайщика,
		|	СУММА(ОстаткиДенежныхСредств.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность) КАК СуммаВВалютеУчета,
		|	МАКСИМУМ(КлиентыДоверительногоУправления.Период) КАК ДатаКлиента
		|ПОМЕСТИТЬ _ОстаткиДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (НАЧАЛОПЕРИОДА(ОстаткиДенежныхСредств.Период, ДЕНЬ) = КурсыВалют.Период)
		|			И ОстаткиДенежныхСредств.Валюта = КурсыВалют.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО ОстаткиДенежныхСредств.Организация = КлиентыДоверительногоУправления.Организация
		|			И ОстаткиДенежныхСредств.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|			И ОстаткиДенежныхСредств.Период >= КлиентыДоверительногоУправления.Период
		|ГДЕ
		|	ОстаткиДенежныхСредств.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ОстаткиДенежныхСредств.Активность
		|	И ОстаткиДенежныхСредств.Организация = &Организация
		|	И НЕ ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.МеждуРасчетнымиСчетами))
		|	И НЕ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.РазмещениеДенежныхСредствНаДепозитномВкладе))
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиДенежныхСредств.Период,
		|	ОстаткиДенежныхСредств.Регистратор,
		|	ОстаткиДенежныхСредств.Организация,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредств.Брокер,
		|	ОстаткиДенежныхСредств.РасчетныйСчет,
		|	ОстаткиДенежныхСредств.ВидДвижения,
		|	ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств
		|
		|ИМЕЮЩИЕ
		|	СУММА(ОстаткиДенежныхСредств.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность) >= &ПорогСрабатывания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправления.Клиент КАК Клиент,
		|	НЕОПРЕДЕЛЕНО КАК ВидПайщика,
		|	НЕОПРЕДЕЛЕНО КАК НоминальныйДержатель,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	ОстаткиДенежныхСредств.Период КАК ДатаОперации,
		|	ОстаткиДенежныхСредств.Регистратор КАК Операция,
		|	ОстаткиДенежныхСредств.ВидДвижения КАК ВидДвижения,
		|	ОстаткиДенежныхСредств.СуммаВВалютеУчета КАК Сумма
		|ПОМЕСТИТЬ ВсеОперацииЗаПериод
		|ИЗ
		|	_ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО ОстаткиДенежныхСредств.Организация = КлиентыДоверительногоУправления.Организация
		|			И ОстаткиДенежныхСредств.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|			И ОстаткиДенежныхСредств.ДатаКлиента = КлиентыДоверительногоУправления.Период
		|ГДЕ
		|	НЕ ОстаткиДенежныхСредств.ОперацияПайщика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ЗаявкаПайщика.ВидПайщика = ЗНАЧЕНИЕ(Перечисление.ВидыПайщиков.Владелец)
		|			ТОГДА ЗаявкаПайщика.Пайщик
		|		КОГДА ПогашениеПаев.ВидПайщика = ЗНАЧЕНИЕ(Перечисление.ВидыПайщиков.Владелец)
		|			ТОГДА ПогашениеПаев.Пайщик
		|		ИНАЧЕ ЕСТЬNULL(ЗаявкаПайщика.Владелец, ПогашениеПаев.Владелец)
		|	КОНЕЦ,
		|	ЕСТЬNULL(ЗаявкаПайщика.ВидПайщика, ПогашениеПаев.ВидПайщика),
		|	ВЫБОР
		|		КОГДА ЗаявкаПайщика.ВидПайщика В (ЗНАЧЕНИЕ(Перечисление.ВидыПайщиков.ДоверительныйУправляющий),ЗНАЧЕНИЕ(Перечисление.ВидыПайщиков.НоминальныйДержатель))
		|			ТОГДА ЗаявкаПайщика.Пайщик
		|		КОГДА ПогашениеПаев.ВидПайщика В (ЗНАЧЕНИЕ(Перечисление.ВидыПайщиков.ДоверительныйУправляющий),ЗНАЧЕНИЕ(Перечисление.ВидыПайщиков.НоминальныйДержатель))
		|			ТОГДА ПогашениеПаев.Пайщик
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления.НомерДоговора,
		|	ОстаткиДенежныхСредств.СчетДоверительногоУправления.ДатаЗаключения,
		|	ОстаткиДенежныхСредств.Период,
		|	ОстаткиДенежныхСредств.Регистратор,
		|	ОстаткиДенежныхСредств.ВидДвижения,
		|	ОстаткиДенежныхСредств.СуммаВВалютеУчета
		|ИЗ
		|	_ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО ОстаткиДенежныхСредств.Организация = КлиентыДоверительногоУправления.Организация
		|			И ОстаткиДенежныхСредств.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|			И ОстаткиДенежныхСредств.ДатаКлиента = КлиентыДоверительногоУправления.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводДенежныхСредств КАК ВводДенежныхСредств
		|		ПО ОстаткиДенежныхСредств.Регистратор = ВводДенежныхСредств.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыводДенежныхСредств КАК ВыводДенежныхСредств
		|		ПО ОстаткиДенежныхСредств.Регистратор = ВыводДенежныхСредств.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|		ПО (ЕСТЬNULL(ВводДенежныхСредств.Основание, ВыводДенежныхСредств.Основание) = ЗаявкаПайщика.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеПаев КАК ПогашениеПаев
		|		ПО (ВыводДенежныхСредств.Основание = ПогашениеПаев.Ссылка)
		|ГДЕ
		|	ОстаткиДенежныхСредств.ОперацияПайщика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеОперацииЗаПериод.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВсеОперацииЗаПериод.Клиент КАК Клиент,
		|	ВсеОперацииЗаПериод.ВидПайщика КАК ВидПайщика,
		|	ВсеОперацииЗаПериод.НоминальныйДержатель КАК НоминальныйДержатель,
		|	ВсеОперацииЗаПериод.НомерДоговора КАК НомерДоговора,
		|	ВсеОперацииЗаПериод.ДатаЗаключения КАК ДатаЗаключения,
		|	ВсеОперацииЗаПериод.ДатаОперации КАК ДатаОперации,
		|	ВсеОперацииЗаПериод.Операция КАК Операция,
		|	ВсеОперацииЗаПериод.ВидДвижения КАК ВидДвижения,
		|	ВсеОперацииЗаПериод.Сумма КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВсеОперацииЗаПериод.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ВсеОперацииЗаПериод.Клиент КАК Клиент,
		|		ВсеОперацииЗаПериод.ВидПайщика КАК ВидПайщика,
		|		ВсеОперацииЗаПериод.НоминальныйДержатель КАК НоминальныйДержатель,
		|		ВсеОперацииЗаПериод.НомерДоговора КАК НомерДоговора,
		|		ВсеОперацииЗаПериод.ДатаЗаключения КАК ДатаЗаключения,
		|		ВсеОперацииЗаПериод.ДатаОперации КАК ДатаОперации,
		|		ВсеОперацииЗаПериод.Операция КАК Операция,
		|		ВсеОперацииЗаПериод.ВидДвижения КАК ВидДвижения,
		|		ВсеОперацииЗаПериод.Сумма КАК Сумма,
		|		МАКСИМУМ(РеквизитыЮридическихЛицАнкетные.Период) КАК ПериодРеквизитовЮрЛиц
		|	ИЗ
		|		ВсеОперацииЗаПериод КАК ВсеОперацииЗаПериод
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|			ПО ВсеОперацииЗаПериод.Клиент = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|				И (РеквизитыЮридическихЛицАнкетные.Организация = &Организация)
		|				И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|				И ВсеОперацииЗаПериод.ДатаОперации >= РеквизитыЮридическихЛицАнкетные.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВсеОперацииЗаПериод.СчетДоверительногоУправления,
		|		ВсеОперацииЗаПериод.Клиент,
		|		ВсеОперацииЗаПериод.ВидПайщика,
		|		ВсеОперацииЗаПериод.НоминальныйДержатель,
		|		ВсеОперацииЗаПериод.НомерДоговора,
		|		ВсеОперацииЗаПериод.ДатаЗаключения,
		|		ВсеОперацииЗаПериод.ДатаОперации,
		|		ВсеОперацииЗаПериод.Операция,
		|		ВсеОперацииЗаПериод.ВидДвижения,
		|		ВсеОперацииЗаПериод.Сумма) КАК ВсеОперацииЗаПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|		ПО ВсеОперацииЗаПериод.Клиент = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛицАнкетные.Организация = &Организация)
		|			И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВсеОперацииЗаПериод.ПериодРеквизитовЮрЛиц = РеквизитыЮридическихЛицАнкетные.Период
		|ГДЕ
		|	РеквизитыЮридическихЛицАнкетные.ОрганизационноПравоваяФорма В(&СписокОПФ_НКО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ВидПайщика,
		|	СчетДоверительногоУправления,
		|	ДатаОперации";

	
#КонецОбласти

	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПараметр		= Макет.ПолучитьОбласть("Параметр");
	ОбластьДоговор		= Макет.ПолучитьОбласть("Договор");
	ОбластьШапкаОпераций= Макет.ПолучитьОбласть("ШапкаОпераций");
	ОбластьОперация		= Макет.ПолучитьОбласть("Операция");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ОбластьЗаголовок.Параметры.Заголовок = "Отчет по операциям НКО за " + ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	
	ОбластьПараметр.Параметры.Параметр = "Организация";
	ОбластьПараметр.Параметры.Значение = ЭтотОбъект.Организация;
	ДокументРезультат.Вывести(ОбластьПараметр);
	
	ОбластьПараметр.Параметры.Параметр = "Порог срабатывания (руб.)";
	ОбластьПараметр.Параметры.Значение = ЭтотОбъект.ПорогСрабатывания;
	ДокументРезультат.Вывести(ОбластьПараметр);
	
	ВысотаШапки = ДокументРезультат.ВысотаТаблицы;
	
	Клиент							= Неопределено;
	ВидПайщика						= Неопределено;
	НоминальныйДержатель			= Неопределено;
	СчетДоверительногоУправления	= Неопределено;
	
	Пока Выборка.Следующий() Цикл
		Если Клиент <> Выборка.Клиент 
		 ИЛИ ВидПайщика <> Выборка.ВидПайщика
		 ИЛИ НоминальныйДержатель <> Выборка.НоминальныйДержатель
		 ИЛИ СчетДоверительногоУправления <> Выборка.СчетДоверительногоУправления Тогда
		 
		 	Если Клиент <> Неопределено Тогда
				ДокументРезультат.ЗакончитьГруппуСтрок(); 
				ДокументРезультат.Вывести(ОбластьПустаяСтрока);
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(ОбластьДоговор.Параметры, Выборка);
			
			Если ЗначениеЗаполнено(Выборка.ВидПайщика) И ЗначениеЗаполнено(Выборка.НоминальныйДержатель) Тогда
				ОбластьДоговор.Параметры.ОписаниеДоговора = СтрШаблон("%1 (пайщик, номинальный держатель: %2)", Выборка.Клиент, Выборка.НоминальныйДержатель);
			ИначеЕсли ЗначениеЗаполнено(Выборка.ВидПайщика) Тогда
				ОбластьДоговор.Параметры.ОписаниеДоговора = СтрШаблон("%1 (пайщик)", Выборка.Клиент);
			Иначе
				ОбластьДоговор.Параметры.ОписаниеДоговора = СтрШаблон("%1 договор № %2 от %3", Выборка.Клиент, Выборка.НомерДоговора, Формат(Выборка.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
					
			ДокументРезультат.Вывести(ОбластьДоговор);
			ДокументРезультат.НачатьГруппуСтрок();
			ДокументРезультат.Вывести(ОбластьШапкаОпераций);

			Клиент = Выборка.Клиент;
		 	СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
		 
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(ОбластьОперация.Параметры, Выборка);
		ДокументРезультат.Вывести(ОбластьОперация);
		
	КонецЦикла;
	
	Если ДокументРезультат.ВысотаТаблицы > ВысотаШапки Тогда
		ДокументРезультат.ЗакончитьГруппуСтрок(); 
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьКлиентов_НКО(ДокументРезультат)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация"			, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала"			, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"		, ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СписокОПФ_НКО"		, ПолучитьСписокОПФ_НКО());
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _СчетаИКлиенты
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаНачала, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала)
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СчетаДоверительногоУправления.Ссылка,
		|	КлиентыДоверительногоУправления.Клиент
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО (КлиентыДоверительногоУправления.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (КлиентыДоверительногоУправления.Организация = &Организация)
		|			И СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.ДатаЗаключения <= &ДатаОкончания
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= &ДатаНачала)
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаИКлиенты.Клиент КАК Клиент,
		|	_СчетаИКлиенты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаИКлиенты.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	_СчетаИКлиенты.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения
		|ИЗ
		|	_СчетаИКлиенты КАК _СчетаИКлиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаНачала,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО _СчетаИКлиенты.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛицАнкетныеСрезПоследних.ОрганизационноПравоваяФорма В (&СписокОПФ_НКО))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_СчетаИКлиенты.Клиент,
		|	_СчетаИКлиенты.СчетДоверительногоУправления,
		|	_СчетаИКлиенты.СчетДоверительногоУправления.НомерДоговора,
		|	_СчетаИКлиенты.СчетДоверительногоУправления.ДатаЗаключения
		|ИЗ
		|	_СчетаИКлиенты КАК _СчетаИКлиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|		ПО (РеквизитыЮридическихЛицАнкетные.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|			И (РеквизитыЮридическихЛицАнкетные.Организация = &Организация)
		|			И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И _СчетаИКлиенты.Клиент = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛицАнкетные.ОрганизационноПравоваяФорма В (&СписокОПФ_НКО))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	СчетДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";

	
#КонецОбласти

	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаКлиент	= Макет.ПолучитьОбласть("ШапкаКлиент");
	ОбластьСтрокаКлиент	= Макет.ПолучитьОбласть("СтрокаКлиент");
	
	ОбластьЗаголовок.Параметры.Заголовок = "Список клиентов НКО за " + ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	ДокументРезультат.Вывести(ОбластьШапкаКлиент);
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаКлиент.Параметры, Выборка);
		ДокументРезультат.Вывести(ОбластьСтрокаКлиент);
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСписокОПФ_НКО()
	
	СписокОПФ_НКО = Новый Массив;
	СписокОПФ_НКО.Добавить(Справочники.ОрганизационноПравовыеФормы.АвтономнаяНекоммерческаяОрганизация);
	СписокОПФ_НКО.Добавить(Справочники.ОрганизационноПравовыеФормы.НекоммерческийФонд);
	СписокОПФ_НКО.Добавить(Справочники.ОрганизационноПравовыеФормы.НекоммерческоеПартнерство);
	СписокОПФ_НКО.Добавить(Справочники.ОрганизационноПравовыеФормы.СаморегулируемаяОрганизация);

	Возврат СписокОПФ_НКО;
	
КонецФункции

Функция ПолучитьВидыОперацийПайщика()
	
	ВидыОперацийПайщика = Новый Массив;
	ВидыОперацийПайщика.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику);
	ВидыОперацийПайщика.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика);
	ВидыОперацийПайщика.Добавить(Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриЗакрытииПИФ);

	Возврат ВидыОперацийПайщика;
	
КонецФункции
